[["November 10, 2018 at 11:56 am", "what GPA is needed for top law schools (social sciences major, unhooked)? I've looked at schools' averages, but I'm wondering how much of a difference going to Princeton makes. Is > 3.85 safe?", "Response from Pablo:\n\nYes, that’s great! I mean, I think that would probably be safe at any good school. From the good friends I know who have gone to Harvard, Yale, etc., I think a ~3.7 from Princeton seems to be fine as well, though the LSAT plays a pretty important role (for better or for worse). Other GPAs might also be perfectly fine as well, this is just completely based on my very limited experience.\n\nOf course, a higher GPA is genuinely not everything. Although this doesn’t mean you should not take your classes seriously, but the goal is ultimately to put forward the most compelling app you can. For everyone out there, my recommendation would be to just do your best GPA-wise and LSAT-wise, be involved in the community, and make sure to build strong relationships with professors. Maybe one day I will be proven wrong, but I believe that if you are genuinely passionate about the law—whatever that means to you—you will end up in the right place—whether that’s a Top 5 Law School or elsewhere—and you WILL succeed. Much love, law school candidates! <3"], ["November 10, 2018 at 11:50 am", "Did anyone get hurt on the Yale buses?", "Response from Sulpicia:\n\nA news article reported that the driver is being treated for unknown injuries and four students are being treated for minor injuries but fortunately nobody was seriously hurt.\n\nResponse from belcalis:\n\nYou can follow the news here: https://fox61.com/2018/11/10/breaking-commercial-bus-crashes-into-building-in-west-haven-multiple-injuries-reported/\n"], ["November 10, 2018 at 11:49 am", "Favorite profs/classes that will be available to frosh this spring? (many of the searchbar suggestions are not open to frosh or not available rn :/ ) Planning on taking COS217, COS340, MAT204, FRSsomething, and looking for a light but interesting 5th to explore some new topics!", "Response from Pablo:\n\nSo, I might add to this later, but I will say WWS 393 is probably at the top of my list. Taught by Heather Howard and has 4.73 as the lowest rating on course evaluations. It’s a course on the ACA and continues to be so tremendously relevant. \n\nAlso, controversial opinion, but I would make sure you do some background research on your freshman sem—between my own experience and those of most of my friends, freshman sems tend to be 50/50 good/terrible! It might not be worth one of those slots :)"], ["November 10, 2018 at 11:16 am", "1.5 standard devs below average is a b- in 309? 4 real?", "Response from Sushi:\n\nOk maybe a C+, but definitely try to improve"], ["November 10, 2018 at 10:44 am", "One of the game buses to Yale just crashed.", "Response from belcalis:\n\nYeah two of them had accidents on the way to the game. Check in with your friends if you know they went to the game!"], ["November 10, 2018 at 9:59 am", "Any recommendations for an interesting/useful STL for next semester? I don't care if it's not considered easy. The typical \"easy\" ones (bridges, psych, mol, etc.) don't really appeal to me.", "Response from Sushi:\n\nThis one is application only, but I’ve only heard good things about it and I personally really want to take it: https://registrar.princeton.edu/course-offerings/course_details.xml?courseid=013598&term=1194"], ["November 10, 2018 at 9:57 am", "I got in the 40s on the ORF 309 midterm and the average was close to 67, with a standard dev of ~16.5. Am I bound for failure in the class?", "Response from Sushi:\n\nNo, but consistently performing around here will be a B-/B probably"], ["November 10, 2018 at 9:49 am", "Do most people here have safe sex by taking birth control or condoms...?", "Response from belcalis:\n\nUmm this is hard to know since most people don’t talk about their sex lives that openly on campus + there is no formal report with numbers so I guess I’ll just give a general safer sex spiel. Please use condoms if you plan on having safe sex. Birth control pills are only 99.9% effective and do not protect you against STI’s/STD’s. It’s recommended for those who can to use both birth control and barrier methods like condoms."], ["November 10, 2018 at 9:38 am", "Which are the least competitive global sems? Also, can you PDF them?", "Response from belcalis:\n\nIt’s kind of hard to tell you which ones are the least competitive when they change every year. Just apply to the one that seems most interesting to you and show genuine interest during the interview. \n\nAs far as the pdf goes, I want to say you can’t but not 100% sure. I was on a global sem this summer and we never got emailed about a pdf deadline."], ["November 10, 2018 at 9:08 am", "marty mcfly i want to meet you in person i think im in love with u", "Response from Marty McFly:\n\nHop on down to jadwin and find yourself a physics major. Chances are he’s single and we’re all identical up to first order approximation lol. I apologize for that, but it was too funny not to use. Def feel free to come say hi though :)"], ["November 10, 2018 at 9:06 am", "How to deal with hookup culture/ expectations of sex in relationships if you’re not that into it? (Aka maybe asexual/ need to know someone super well before even considering it)", "Response from Marty McFly:\n\nThe main thing is to be confident in your decision. If you mean that your partner is pressuring you into stuff, that’s not ideal, and you should talk to them. They probably mean well, so just explain that it makes you uncomfortable. If that doesn’t work, you probably shouldn’t be hanging out with them. I’m guessing you’re talking about ‘societal expectations’ where it’s like ‘oh you’ve gotta be constantly getting it to be in a good relationship.’ I def get that but you’ll also really regret making decisions on that basis. Believe it or not, there are no authorities that patrol this. In fact, no one even knows/judges you based on such minor things in reality. The very useless sounding advice I’ll give you is just don’t do anything you’re uncomfortable with and after a little time you’ll realize that everything is fine and that you were worried about nothing. It’s honestly not a bad way to find out if you’re boyfriend/girlfriend is in it for different reasons. Admittedly, it can be made a tad more difficult if you have friends that all live their lives another way, but I’m sure they’ll support you however you wanna do things. "], ["November 10, 2018 at 8:48 am", "To fulfill my last gen ed requirement, I am enrolled in a class which I now realize I am not able to pdf. I currently have a solid A- but have been so stressed and overwhelmed with my thesis and job applications and my other classes and was hoping to be able to pdf and relax for a little in this class while I got everything else under control. There's about 35 people in the class. Should I bother asking for an exception?", "Response from Regina:\n\nyou can definitely try but being that it was probably listed on the registrar with (npdf) you likely wont be able to get an exception unfortunately"], ["November 10, 2018 at 8:47 am", "How easy is it to get a SWE intern at Facebook as a sophomore?", "Response from Regina:\n\nthis depends completely on who you are as a coder, what classes you’ve taken, how you do on the coding challenge etc etc"], ["November 10, 2018 at 8:13 am", "For the person asking about SOC207, I haven’t taken SOC101 but 207’s workload (and grade) depend on how much you commit yourself to your fieldwork. You can skim readings and lectures, as your grade is basically your research project. Super fun class, though, and Desmond is an amazing prof", ""], ["November 10, 2018 at 2:59 am", "Best 200-level spanish class? (above 209)", "Response from Primrose:\n\nI’ve heard really good things about SPA 211!"], ["November 9, 2018 at 11:09 pm", "Do you already need to be an excel whiz before your first finance internship? It okay to be familiar with the basics and then learn and get better on the job?", "Response from Regina:\n\nyes\n\nhahahh sry just read this this morning and realized it doesn’t make sense,\n\nyes meant that you can know the basics and then get better on the job"], ["November 9, 2018 at 10:41 pm", "For OP asking about EEB384, it is strictly open to EEB majors ... if you read closely the class is in Kenya", "lmao"], ["November 9, 2018 at 10:25 pm", "Omg savage Katara... but still... any advice on how to approach this?", "Response from Katara: \n\nI really can’t think of any good way to run into a total stranger in a library lol. By in front do you mean like directly across the table from you or at another table in front of you? If the latter, Maybe keep walking up and down past him to get him to notice you? I don’t really see what that would accomplish but at least he might look at you. You could ask to borrow something? Or maybe wait for him to get up and leave then follow him out of the building (joke)"], ["November 9, 2018 at 9:45 pm", "PSY 309 didn't have problem sets last year. Just quizzes each precept on the readings and lectures.", ""], ["November 9, 2018 at 9:09 pm", "Would there be a problem if I order a microwave online and have it sent to Frist? Like fire safety restriction or something?", "Response from Regina:\n\nnope youre fine"], ["November 9, 2018 at 8:47 pm", "EEB 384 says it's only open to EEB majors, is this a hard and fast rule? I'm a GEO major and feel like this class is super relevant to my independent work and other GEO classes", "Response from Katara:\n\nEmail the prof and see if there are exceptions, they wouldn’t have said EEB majors only if they weren’t going to enforce it."], ["November 9, 2018 at 8:46 pm", "There is a super hot guy who is sitting in front of me in the library... what can I do?", "Response from Katara:\n\ndo your homework"], ["November 9, 2018 at 8:22 pm", "i really don't want to be alive right now. not thinking of ending my life, just overwhelmed with everything and cannot handle being a person.", "Response from Opal:\n\nI know exactly how you feel, and I am so sorry to hear this. I could give you any amount of practical advice on how to ameliorate your feelings and stay functional, but I don’t want to make judgments about your situation, so I just want you to remember this: No matter what is going on, no matter how you are doing, you will always be more than enough simply by virtue of existing. Your presence is a gift. Everything about you is worth it. I have no idea who you are, but I am so incredibly proud of you for just getting out of bed on any given day and facing the world, because personhood is damn difficult and our shoulders were never meant to bear a lot of the heaviness that lands on us anyway. I wish and hope that things become lighter soon, but until then, keep breathing and keep being, and know that even the most barebones version of you is infinitely beautiful and deserving. I am so grateful for you."], ["November 9, 2018 at 8:06 pm", "@Opal, your response to the existential exhaustion question was amazing. I’ve never heard my own life philosophy put so beautifully.", "Response from Opal:\n\nAww thank you!! I’m so glad that you appreciate it 💗"], ["November 9, 2018 at 8:03 pm", "does henry hall have common rooms or somewhere to study?", "Response from Opal:\n\nI would honestly explore it myself and report back, but I am busy at the moment! The housing website says that there are « independent rooms » and « music practice rooms » in Henry Hall. I interpret this to mean that, yes, there are some study spaces available; readers who are familiar with the building, care to help out?"], ["November 9, 2018 at 6:18 pm", "what are the academics like in the Russian global sem?", "Readers?\n\nResponse from Winnie P:\n\nsorry I don’t know who posted this. I asked someone I know that took it, so I’ll have a response eventually. I’ll just repost it when I get it.\n"], ["November 9, 2018 at 6:18 pm", "what are problem sets in psych of language (PSY 309) like?", "Readers?"], ["November 9, 2018 at 6:18 pm", "for anyone that’s taken soc207 how is the workload compared to SOC101?", "Readers?"], ["November 9, 2018 at 6:18 pm", "Between taking POL315 with Robert George or POL316 with Robert George, which one would you choose?", "Readers?"], ["November 9, 2018 at 6:18 pm", "what's the boost for doing the extra-credit assignments in COS 126?", "Response from Sushi:\n\nAsk your preceptor"], ["November 9, 2018 at 6:17 pm", "COS 320 is with Kincaid next semester, is he a good prof? Also what's the grade distribution like in 320, aka can I take it and hopefully get a B+ or above with a solid amount of work", "Response from Sushi:\n\nNone of my friends have taken this class or any class with this professor. Readers?"], ["November 9, 2018 at 6:17 pm", "I took COS 324 when it was first offered, is it still worth it to take COS 424? I feel like I learned a lot of theory in 324 but I would like to learn how to practically apply them (in case i need to use it in future projects/jobs), but I also don't want to be learning a lot of the same things again since they're both intro classes.", "Response from Sushi:\n\nI feel that you will end up learning a lot of the basics again, but I don’t think it would hurt for you to take 424 if you want to learn applications"], ["November 9, 2018 at 6:17 pm", "Is cos 423 or 445 harder?", "Response from Sushi:\n\n423"], ["November 9, 2018 at 6:17 pm", "Any suggestions for COS classes to take for a sophomore taking 217 this spring?", "Response from Sushi:\n\n340"], ["November 9, 2018 at 6:17 pm", "COS 217, PHY 104, PHI 201, EAS 234, and creative writing: would this schedule be too non-technical for a sophomore cos major?", "Response from Sushi:\n\nIf you haven’t taken any COS departmentals yet (including those in other departments, such as ORF or MAT) I might recommend COS 340 instead of one of your humanities electives just to ease the burden of departmentals later on, but you know best"], ["November 9, 2018 at 6:16 pm", "Why do some courses get great reviews one semester and bad reviews the next even though the instructor is the same? COS 432 and COS 461 are both like this. Should I avoid them if the most recent reviews are bad?", "Response from Sushi:\n\nCourse sizes, teaching assistants/staff/preceptors could change, etc. You shouldn’t necessarily avoid them, just take the reviews with a grain of salt and try out the class for yourself"], ["November 9, 2018 at 5:42 pm", "Can a class taken to fulfill a certificate requirement also be used as a WWS core req / elective?", "Response from Harvey:\n\nDepends, but generally yes\n\nFor instance, an econ class i take could also count towards my political economy certificate as a cognate\n\nOn the flip side, there are a few POL classes that I could take for my certificate that would also count as an Econ departmental elective"], ["November 9, 2018 at 5:40 pm", "B+, B, C and N in midterms. Does that mean I won’t get accepted to a global sem?", "Response from Harvey:\n\nnot necessarily; a good number of global sems are not competitive\n\nat the same time if you’re a first year and those are the only grades you have to submit for your app, then y ikes\n\nResponse from Bateman:\n\nTry to pull the C up, but I would say you’re fine for a global sem. Your grades aren’t concerning as a frosh don’t worry about it"], ["November 9, 2018 at 5:39 pm", "Different opinion on the 101 thing: Blinder and Bogan are both wonderful (took 101 with Blinder and other courses with Bogan) so just take it whenever you want to take 101 assuming either is teaching it -- I've heard there's also a bit more reading involved with Bogan's 101 so that may be a plus or minus depending how much macro immersion you want", "Response from Harvey:\n\n\n\n\nagreed that Bogan’s course has more memorization/reading aspect but as a lecturer she’s way better IMO\n\nhave a few horror stories from friends who took eco101 w/blinder"], ["November 9, 2018 at 5:04 pm", "If I eventually plan on taking both ECO100 and ECO101, would it be worth it to take ECO101 first next semester since it's being taught by Blinder or is it overhyped?", "Response from Harvey:\n\n\n\n\nECO101 with Blinder is the worst time to take ECO101; most students, myself included, much more enjoy ECO101 with professor Bogan"], ["November 9, 2018 at 4:42 pm", "With which 300 level Econ classes do most Econ concentratators come into junior year?", "Response from Kronk:\n\nfrom my senior Econ major friend who is sitting next to me rn, the majority of people will have already done either 300/310 or 301/311 at least going into their junior year and ~half will have already completed both of them. but there are people every year who start junior year having completed none of the required 300-levels yet"], ["November 9, 2018 at 4:36 pm", "I want to sign up for a course for which I haven't taken a prereq (but the professor told me it's fine) – will I encounter issues on TigerHub when enrolling / should I ask the professor to enroll me instead? thanks!", "Response from Marty McFly:\n\nYou’ll be fine. Tigerhub doesn’t check"], ["November 9, 2018 at 4:35 pm", "My phone automatically connects to puvisitor (seems to work fine). Is there a difference in connection between eduroam and puvisitor?", "Response from Marty McFly:\n\nNah they’re both pretty much equal. I know people that stayed on puvisitor on their phone all four years and it was fine"], ["November 9, 2018 at 4:35 pm", "can anyone explain what \"nani tf\" means? and the shocked pikachu face that my friends keep tagging me to see?", "Response from Marty McFly:\n\n\nLmao my friend says that all the time. He says it cause nani means what in japanese, so it’s just a weird way of saying wtf. The pikachu face is just a reaction picture. Presumably it’s preceded by some text and then the face represents being surprised. Btw thank you for my favorite question ever."], ["November 9, 2018 at 4:04 pm", "Any idea if EEB417 will be offered ever again? Really want to take the class for sustainable energy certificate requirement; also what are the prereqs for it? The registrar website doesn't specify", "Response from Kronk:\n\nlooks like the only time recently that EEB417/ENV417 was offered was Fall ‘16, so it doesn’t seem like it’s a regularly scheduled course. From the reviews, it doesn’t seem like there are too many prereqs other than a basic knowledge of environmental/climate science because past students say things like “amazing survey course” and “there were philosophy majors who were taking this class as their first ever lab”. Looks like a great class, the only way to figure out for sure if it’ll ever be offered again is by emailing Lars Hedin and expressing interest."], ["November 9, 2018 at 3:58 pm", "What transcript should I submit for the global sem?", "Response from Kronk:\n\nthe unofficial one that you can download from tiger hub is fine"], ["November 9, 2018 at 3:57 pm", "What classes will be going on a spring break trip?", "Response from Kronk:\n\nANT215 to Kenya (but only a subset of the class gets to go, you have to apply after you sign up for the course)\n\nSPA204 to Ecuador (but you have to speak Spanish)\n\nLAS308 to Mexico City, ART429 to Japan, and ANT392 to Greece (all require applications)\n\nsubmit more if you hear about any others!\n\nResponse from Katara:\n\nWhen the recourse website comes up with spring 2019 classes,  it has a class trip option you can select for when looking at classes \n\nResponse from Scarlett O’Hara:\n\nAlso ANT 392 to Greece (requires application and interview)"], ["November 9, 2018 at 3:57 pm", "advice for cap bickering? or just bickering in general?", "Response from Katara:\n\nI’d say above all do be yourself. Remember its not like a interview for a job or anything, you’re talking to other college kids probably your age who just want good people in their club to eat meals with and stuff. So putting on a show/ trying to be someone you’re not is probably not the best option because ppl can see right through it. For cap specifically you can search bar for details (cap bicker nick) but I know there bicker involves games and activities, so try to be “fun and outgoing” but also not dominate conversations or rub people the wrong way. That kind of goes for any club, if you’re bickering somewhere where you don’t know a ton of people, you want to have memorable conversations so people remember you. I also would ask members you know in the club specifically about the bicker process and cap itself, they’ll probably be more than happy to tell you.\n\nBut also going off that, bicker is decided by a bunch of college kids who really don’t know anything about you in the long run so don’t take anything that happens (good or bad) to heart. \n\nResponse from Kronk:\n\nYup, agreed with all of the above - being yourself and trying to be friendly are the key pieces of advice imo. For cap specifically, I know other members like it when someone bickering genuinely shows or has shown interest in the club, whether that’s through coming to pre-bicker events (coming soon, I believe), coming to nights out, or just having a really good why cap? answer. The key word in that sentence is genuine. If you’re a soph and already have friends in the club to ask questions to, then great; if not, then definitely come to events and talk to members and ask questions too.\n\nCap bicker is a mixture of games and conversations, mostly leaning towards games. A lot of members get really reallly into designing their games and trying to make it fun and just get super bummed when a bickeree doesn’t seem like they’re into it/not participating. Nothing is designed or allowed to be uncomfortable and if something does make you uncomfortable, you should report it to an officer immediately, but for the most part, a lot of members are trying to see if you can let loose a little and enjoy yourself. That being said, Katara is right in that you shouldn’t overdo it and be the only person in the circle talking the entire time. Another thing is that a lot of games or conversations will involve asking bickerees to tell us a story or something interesting about themselves, and some people unfortunately come up with some pretty inappropriate things that don’t sit well with a large audience, so just be mindful of that too.\n\nAnd at the end of the day, bicker is a process in which a small group of people get to talk to you for an average of <7 minutes each in an unnatural environment for a cumulative total of less than a few hours. So it truly has 0 basis in determining anything real about anyone - so just have fun with it however you can"], ["November 9, 2018 at 3:15 pm", "@arcade games question. Princeton Students Events Committee organized the Arcade Night so you could probably talk to them about it. Very cool of them to do that", ""], ["November 9, 2018 at 2:42 pm", "APC350, PHY208, ORF309, COS126, HIS361 for sophomore spring; how dead am I gonna be", "Response from Marty McFly:\n\nHonestly sounds doable. I’m assuming you’re pretty solid at math, so you’ll be able to handle phy/orf/apc pretty well. Don’t be afraid to pdf or drop history if things are getting out of hand. "], ["November 9, 2018 at 2:40 pm", "overwhelmed frosh :( I feel like I don't have enough time to do schoolwork AND apply to summer opportunities AND extracurriculars AND have balanced mental health. help?", "Response from Marty McFly:\n\nIt’s very likely that you don’t. I guess just organize everything in a sustainable way. So be really real with yourself about how much time you need for each thing, and look at your schedule and ask yourself where it will fit. Like plan out an entire week such that you have enough time set aside for everything you want to do (with an appropriate amount of wiggle room). And don’t forget to factor in time that’s wasted walking, eating, getting distracted talking to someone, etc. Is it something you could/want to do every week? If the answer is yes, then you just need to maintain that level of organization. Keep track of all your long term responsibilities in one place, your weekly responsibilities in another place, and make yourself a daily list of things that need to get done that day. Once that’s done, trust yourself. Assume that nothing needs to get done besides what’s on the list, and forget about everything else. If you find yourself with free time, you move on to things that are due later. If you’re being as productive as you predicted, you’ll be totally on top of stuff. \n\nIf you can’t to that, then you’re gonna have to get rid of some stuff. Think about your priorities and what you can afford to drop/pdf/quit. It’s not very likely that everything you’re doing here is worth taking a substantial hit to mental health, so don’t compromise on that. If you need help deciding, talk to PAAs/RCAs/advisors/resubmit with what you’re considering dropping and we can try to advise. As far as I know, there is no third option. "], ["November 9, 2018 at 2:40 pm", "phy104, orf309, cos340, psy309, and a vis class for soph spring? would phy lab and vis studio be too much class time?", "Response from Flounder:\n\nthat looks like a lot. Vis studio takes a lot of time, physics isn’t easy, orf309 and cos340 together works well but is also going to eat up a good chunk of time. psy being comparatively easier isn’t going to help much esp if you’re not pdfing. Is this schedule your only option?"], ["November 9, 2018 at 2:38 pm", "international student here. Does my credit score drop every month I miss the princeton uni bill?", "Response from Flounder:\n\nno, the credit companies have no way of seeing what happens with the University bill. Thus it will not affect your credit score. If however you’re having trouble paying your bill, ask the financial aid office how they might be able to help - don’t just wait for the situation to resolve itself!"], ["November 9, 2018 at 2:36 pm", "Is there anyway to be reactivated on sona for psych studies? I accidentally missed two last year so I got deactivated and I still can't sign up for any, but would like to.", "Response from Flounder:\n\nemail the person in charge of sona and ask? but i think you might be deactivated permanently."], ["November 9, 2018 at 2:34 pm", "@sophomore a cappella girl, you definitely have a shot, but to maximize your chances highly highly recommend talking to members/people involved in the groups you're interested in, bc there are definitely some groups that have more space for certain voice parts/years than others", ""], ["November 9, 2018 at 2:33 pm", "there's so much stuff happening this weekend!!! triangle, expressions, intime's greek shows – what are you guys going to? i'm tryna organize my life lol", "Response from Marty McFly:\n\nPreparing for my midterm lol. I think I’ll try to go to one of the intime shows if I am even slightly productive in studying this weekend. You can’t go wrong though everything sounds great\n\nResponse from Scarlett O’Hara: \n\nYou win most relatable post of the day lolol. Really thursday-sunday are jam packed of amazing events! Since I’ve been to two art museum exhibitions/ talks in the past 24 hours, I decided that I’ve gotta settle down and can only go to the triangle show :( Hopefully you can make it to expressions or the greek show so I can live vicariously thru you, OP! Hope you have a great time!!!"], ["November 9, 2018 at 2:31 pm", "If I've taken PHY208 and PHY305, can I take the graduate level course in quantum mechanics(PHY506)?", "Response from Marty McFly:\n\nI think so, but I don’t know anymore than you do. I don’t see any reason why not though, what else could you really need?"], ["November 9, 2018 at 1:41 pm", "cbe premed frosh looking for a good 5th class? should I take an EM distribution req or something super chill? as of now I have cbe 246, phys 104, mat 202, and writing sem... please help!", "Response from Primrose:\n\nI would look at freshman seminars either for your EM distribution or just any topic you find interesting! They’re generally really chill and a good way to meet professors in a smaller class. "], ["November 9, 2018 at 1:39 pm", "How are the dance classes at Princeton? I'm interested in taking intro to ballet since I've always loved ballet but can't dance (lol). Are there any types of specific clothing required (leotard, etc.)? want a possible fifth class that can allow me to destress a bit. thanks in advance :)", "Response from Kronk:\n\nDance classes are SO FUN. They’re like a guaranteed workout twice a week, the teachers are all so chill and so nice, and honestly, most of it is about being engaged and trying your best and having a good time. I haven’t taken intro ballet specifically, but I’ve heard amazing things and from my friend who took it, there aren’t required pieces of clothing (no leotard necessary), but you have to wear shoes and general athletic clothing that’s easy to move around in. dance classes are amazing fifth classes, definitely good for de-stressing, and don’t worry if you can’t dance. they’re all designed for beginners and the vast majority of people in the class will also be people who “can’t dance”, so don’t worry about that"], ["November 9, 2018 at 1:36 pm", "Dev psych is a bullshit class", "Response from Kronk:\n\nbut at least babies are cute!"], ["November 9, 2018 at 1:35 pm", "I’m really just bad at chemistry labs? I do all the steps correctly but my results just never turn out right and I can never seem to titrate to the right endpoint. Advice and will this affect my grade if I’m writing all the reports otherwise?", "Response from Kronk:\n\nl m a o one time in orgo lab, my yield was like 1% and I asked my TA if that was enough for the lab check and he just laughed at me and said “not if you want to pass”. \n\nbut yeah same here when I was in chem lab. I think titrations are especially ridiculous because you’ll think you’ve reached the endpoint, you’ll ask the TA for a check, they’ll tell you titrate a little more, and then boom you’ve overtitrated. I think as long as you get at least some semblance of the right product, you’re fine for the lab - it’s more of the analysis that they care about than the actual lab performance. So in the write up, as long as you’re answering all their questions, doing their calculations, and then in the discussion, talking about sources of error & how your results would have been different with better titrations, then you’ll be fine on the lab grade. I wouldn’t be too worried about how “good” the physical results are, it’s more about how you think about it. if you fuck up a lab too much to the point that you couldn’t do the lab, the lab TA will let you know and you’ll have to redo it lol (have seen this happen before)"], ["November 9, 2018 at 1:27 pm", "@kronk, response to answer on naked club... which club is it and is it legit? how can i join?", "Response from Kronk:\n\nlol it’s not “legit” as in like ODUS-approved or anything. from what I’ve heard, it’s more of like an informal gathering. I only knew it existed bc my old RCA used to host them in his room regularly. I think joining/being invited is mostly by word of mouth, so I’m sorry I can’t be more of a help to you in terms of participating :/ \n\nif any readers have any more info to provide, esp on how to get involved, send us a message!"], ["November 9, 2018 at 1:21 pm", "How were the arcade machines brought to Frist? Are they stored somewhere on campus or brought by some kind of service? I joked with a friend about starting a DDR club in the past and am now wondering if that would actually be possible", "Response from belcalis:\n\nPretty sure they were rented from an outside company and brought to campus. "], ["November 9, 2018 at 1:14 pm", "p.s. about 309 freshman year, you definitely don't need to be IMO math level lmao. any background in contest math is extremely useful, also helps to know how to do proofs; having taking any proof-based math class will be great!!! but the first few weeks are simple proofs. so you can definitely learn as u go. worst case, try it and drop.", ""], ["November 9, 2018 at 1:14 pm", "i took orf 309 freshman spring, does not hurt to email the prof and ask", ""], ["November 9, 2018 at 1:12 pm", "so, freshman here already going through a crisis of major: im currently an AB student (projected EEB major), but im yet again considering CEE. would it be worth it to switch to bse and try out cee and then switch back to ab soph year if i change my mind? Also, im not currently enrolled in a math class (though i have taken BC w/ a 5 and took a multivariable course), would i have to take multi again or could i place into lin algebra?", "Response from Opal:\n\nSeeing as BSE has a lot more requirements, if you are seriously considering CEE, it might be worth making the switch now. There is a good amount of overlap between BSE and EEB prereqs - you have to take chem for both, you have to take physics for both, and you have already knocked out the EEB math requirement with your calc AP. This means that if you do CEE for a semester or two and then decide that you want to go back to EEB, you really only have to squeeze in those two intro EEB classes (or one if you have AP bio credit) and a stats class before junior fall, which is doable. You still have time to explore and solidify your interests, but start tackling those BSE classes if there is a real possibility of you ending up with CEE. Also, for your last question, you could always take a math placement test - there are probably students who place straight into linear algebra every year, but I will say that the majority of people who come into Princeton with a background in multivariable calculus still take MAT 201/203 anyway, because those classes go into more depth than most high schools do. Best of luck with everything!"], ["November 9, 2018 at 1:03 pm", "If there is a course that requires an application and you're not accepted, can you still ask the professor to just put you in the class if you make a good case?", "Response from Regina:\n\nyou definitely ask but i doubt theyd let you in"], ["November 9, 2018 at 12:58 pm", "Anyone know if the dining hall chocolate milk is whole or fat free?", "Response from Opal:\n\nI am, like, 85% sure that it is fat free."], ["November 9, 2018 at 12:57 pm", "how do acapella auditions work for girls? how many songs do you prepare? do I have basicaly no change as a sophomore?", "Response from Opal:\n\nAuditions are pretty formulaic across the board. You start off by singing some scales to warm up your voice and give some indication of your vocal range. Then, they will ask you to do some pitch-matching exercises (they play a series of notes and you sing them back), pitch-finding exercises (they play a series of chords and ask you to sing back the top, middle, or bottom note), and maybe some swells (you sing a note as softly and as loudly as you can). There may be a couple of groups that will also give you sheet music and test your sight-singing ability, but that is not super common. Finally, you get a chance to perform your prepared piece - one verse and chorus of one song should be enough. And then you are done! If you get a callback, they usually teach you songs during that process, so there is really no need for you to prepare more than one song beforehand, but I also do not see how it would hurt to have multiple songs up your sleeve. One time, I got too sick to hit the high notes of my prepared song on the day of a musical audition, so I walked into the room and sang an alto-range piece instead, because I also happened to know it well. Anyway, as a sophomore, you definitely still have a shot with basically any a cappella group. Kudos for putting yourself out there, and good luck with your auditions!"], ["November 9, 2018 at 12:42 pm", "Best PDF classes for lazy seniors that are also not a complete waste of time?", "Response from Opal:\n\nOther contributors should add on, but I really feel the need to at least briefly plug theatre classes on this blog. Setting aside the fact that I have yet to take one at Princeton, all of the ones offered this spring are highly reviewed, and almost all of them are either PDF-only or PDF-able, and more importantly, I seriously believe that getting exposure to theatre will change your life. Whether you take an intro to acting or an atelier about puppets and movement or a course on costume and set design, you will learn so much about how to navigate the intersections of reality, identity, and expression, and you will take those skills and understandings with you wherever you go, long after the class is over. I am not even going to throw in a cheesy “All the world’s a stage” at this point, because theatre does not make you more performative or artificial - on the contrary, it forces you to engage deeply with truth and essentials, both within yourself and within the wider universe. I know I am waxing overdramatic, but a) I am a theatre kid, so deal with it, and b) it truly commands that much power. You describe yourself as a “lazy senior,” and you will absolutely be in control of how much or how little work you put into a theatre class, but I will just leave you with this: There is a distinct possibility that you will end up not wanting to hold back your effort!"], ["November 9, 2018 at 12:24 pm", "Does u-store have carton egg whites", "Response from Opal:\n\nI have never seen carton egg whites in there - I think you may just have to buy eggs and then retrieve the whites from them individually."], ["November 9, 2018 at 12:22 pm", "How to deal with existential exhaustion?", "Response from Opal:\n\nSure, existence has no extrinsic significance, and any meaning that we could possibly ascribe to our lives is constructed, yet I do not believe that to be discouraging in the slightest. I know very little about philosophy, but I think that nihilism can be comforting and even optimistic. You see, the universe is the ultimate open-world sandbox game, and there is no end goal - there are only achievements. Some of those include making yourself happy. Some of those include making others happy. Nothing actually matters, which I see as the best reason of all to be a force for light and joy. The atoms in all of our bodies are borrowed ones, and they belong to us for a breathtakingly evanescent window of time before dissipating back into a sea of entropy - which renders life all the more precious, which renders our temporary sentience and consciousness and ability to explore the cosmos all the more exciting and rare. You are, always have been, and always will be intimately connected to everything else, but only now - now - now - do you have the opportunity to make sense of it. Like I said, all meaning is constructed, but it does not have to be artificial, because you get to be the one who imbues it with power. If you say “Let there be light,” then there will be light. Now get out there, shake off your exhaustion like a coat of dust, and make someone smile before the day is over."], ["November 9, 2018 at 12:18 pm", "is B,B,B,C+ bad midterm grades for a frosh who wants to go to a top10 business school?", "Response from Bateman:\n\nDuke is top 10 and has a GPA range of something like 3.0-4.0. With B school, you tend to go back after working for a while, so your gpa is less important than law or med school. You can google these statistics for yourself. Youre not given much slack on gpa just because you go to princeton if that’s what youre asking. that goes for most programs "], ["November 9, 2018 at 12:16 pm", "Do they like me or do they want to cuff", "Response from Bateman:\n\nprobably a bit of both"], ["November 9, 2018 at 12:14 pm", "re: kernighan vs dondero. war stories from the front lines?", "Response from Sushi’s friend:\n\nAs for war stories, at the risk of sounding like a fanboy, Kernighan is a living breathing piece of comp sci history. He is the K in K&R C, one of the seminal books on the language, also the k in awk which is useful for processing data at the command line. He’s worked with some of the greatest at Bell labs and also taught some of the smarty pants making waves now. In this way, his lectures are war stories from the front lines of computing and how we got to where we are today."], ["November 9, 2018 at 12:14 pm", "How would you respond to the opinion: Princeton is better than Stanford for entrepreneurship because it has a huge endowment that is underutilized. Read from another answer but looking for expansion/reasoning.", "Response from Bateman:\n\nStanford is more established as a school for entrepreneurship but because Princeton is expanding its resources is less known for it, you may get more resources and attention here. I’m not sure what the endowment has to do with it, but there is a lot of funding for the keller center and it has been expanding its programs. Entrepreneurship is not as rigid than traditional recruiting (can you even teach entrepreneurship in a classroom), so you in theory can do it anywhere though "], ["November 9, 2018 at 12:09 pm", "Any idea when they let us know what FRS we were placed into?", "Response from Scarlett O’Hara:\n\nEarly December"], ["November 9, 2018 at 11:32 am", "@readers, has anyone taken cos226, orgo, and cbe246 in the same semester? how was the workload?", "Posting for reader submits"], ["November 9, 2018 at 11:31 am", "Sushi r u cos", "Response from Sushi:\n\nYeah"], ["November 9, 2018 at 11:20 am", "how is cos 423 compared to 340? would you say its less stressful because there's no exams? also, since it's entirely pset-based are you pretty much guaranteed a good grade?", "Response from Sushi:\n\nFrom my friend who’s taken both:\n\n“423 is harder\nthere’s no collab psets which r basically like take home exams\nsome grading is tough”"], ["November 9, 2018 at 9:48 am", "If you’re trying to get triangle show tickets but can’t make it to buy them, can your friend buy it for you without your prox?", "Response from Scarlett O’Hara:\n\nYup all they have to do is pay the $10 for your ticket, my friend bought my ticket at frist a few days ago without my prox"], ["November 9, 2018 at 9:44 am", "MAT 202, PHY 104, writing sem, FRE 108.. first two will be completely new content (this semester multi and econ, which is a little easier, were new subjects). What's an easy fifth class? I did p well this semester, getting just about all A's but ain't tryna work as hard as I did next semester.", "Response from Scarlett O’Hara:\n\nWe’ve talked about a wide variety of good fifth classes/ pdf classes, so you’re best bet is to use the searchbar and look thru what interests you. (Usually I wouldn’t just refer people to the searchbar but you don’t seem to have a specific type of class in mind, so that’ll give you a nice selection of easier classes to pick from). "], ["November 9, 2018 at 9:29 am", "how do i deal with crippling loneliness? it feels like everyone is already friends with each other and im just an outsider doing psets alone, eating alone, spending my free time in my room doing nothing", "Response from Scarlett O’Hara:\n\nI’m so sorry you’re feeling this way. You are definitely not the only person:For proof that not “everyone is already friends with each other”, please look up “lonely” in the searchbar. That one keyword brings up 83 results (and think about all the synonyms for “lonely”, so there must be at least a couple hundred posts about feeling this way). Most groups that look like close friends are not even that close (for proof, see all the posts where people are sad that they’re not satisfied in their friendships). \n\nIs the problem that you feel like you don’t have enough friends or that you feel like you don’t hang out with them enough? We’ve answered many variations of both of these questions, so use the searchbar for a wide variety of advice. If you’re freshman, please know that almost every freshman has this phase or recurring feeling. Whatever your year is, the number one ways to make friends are asking to do psets with other people, putting yourself out there and texting acquaintances/classmates you talk to if they wanna grab a meal or go to an event, joining clubs. If you’re eating alone and notice someone you kind of know or have met who is also eating alone, don’t be afraid to ask if you can join: Even though it’s totally fine (and sometimes actually really nice) to eat alone, you’re not the only person who’s eating alone and wishes there were other people with them. Last year, none  of my good friends from my res college liked eating breakfast or our schedules didn’t line up, so I at breakfast alone most days (which I actually enjoy bc it’s hard to make convos when you’re groggy lol) UNTIl mutual friends that I’d met a few times realized that we were all eating alone when we could’ve been eating together. Basically my point is that if you look/ask around, you’ll see that there are a ton of other people doing things alone (either by choice or bc they’re lonely) and most of them are totally open to making/strengthening friendships! \n\nThe hardest part of getting out of the loneliness is making the first new friend, once you’ve made one move, the following ones are so much easier! Please believe me when I say that, even though people with a lot of friends stand out more bc they’re louder and take up more space, there are so many other people who are lonely or eager to make more good friends. If I didn’t touch on anything that helps you out, check out past posts about loneliness that so many rtp contributors have answered. If your loneliness is really crippling you, don’t be afraid to make a CPS appointment bc maybe it’s part of a larger issue that needs to be addressed by a caring, knowledgeable professional. Even though I don’t know you, I care about your well-being, so please seek help if you feel you might need it. Love you OP and I wish you the best of luck,  please trust me when I say you’re not alone and it does get better."], ["November 9, 2018 at 8:57 am", "Does this schedule sound doable for freshman spring? MAT 202, COS 217, PHI 201, FRE 107, and writing sem.", "Response from Sushi:\n\nYes, this sounds great"], ["November 9, 2018 at 8:56 am", "I am considering taking COS217, ORF311, COS324, ECO310, PHI201 (PDF). How does it sounds like?", "Response from Sushi:\n\nOn the harder side, but ok if you’re good at math/programming"], ["November 9, 2018 at 8:49 am", "Lmao what the heck Scarlett did you even sleep last night? You were answering qs at 1am and then again at 7am but clearly it’s not because you’re busy because then you’d be doing work instead of answering questions!", "from sushi’s friend\n\nFor all the readers asking about COS 324 next semester. Other options are ELE 364, COS 424, ELE 435, MAT 490. From friends, ELE 364 is basically “machine learning for future consultants” - lots of memorization and no real programming or theoretical component. From previous RTP posts, COS 424 offered in the spring is seems to be “guide to programming with Python ML packages” (maybe Tensorflow, PyTorch, etc (sushi comment: scikit learn i think)). COS 324 is the theory ML class if you’re scared of MAT 490 (like me!). Not sure but from hearsay maybe more intense than 435?\n\n(sushi comment: also ORF 350, which is offered next spring at 8:30 am. It was a good class under Han Liu, but we aren’t sure how it will be under the new prof)\n\nYes, it’s still Prof. Adams teaching it. Prof. Adams’s version is “significantly less theoretical than previous [Hazan/Singer] versions of the course.” It’s still theoretical.\n\nPrereqs:\nORF 309 - didn’t take, doable without but probably recommended, been making do with MIT 18.05 lecture notes and PDFs\nMAT 201/203 - took 201, know how to take gradients of vector valued functions in   matrix form (look at matrix cookbook) and integrate\nMAT 202/204 - took 202, 202 is enough, just look up properties that you forget\nCOS 226 - probably so you know how to write “non-trivial programs in Python”\n\nMight be helpful, with this background I’m a tad above the median after midterms (Prof gives stats for every assn). Also, for some reason a bunch of grad students took this course this semester (>25% of the class estimated), not sure how that affects things.\n\nLecture:\n   - Prof. Adams writes derivations of results used to construct machine learning algos on the blackboard and\n   - shows demos, they’re pretty good\n\nAssignments:\n - Takes me ~8-9 hours/week (due every 2 weeks)\n - 5-6 problems usually, mixed theoretical/coding (they’re here: https://www.cs.princeton.edu/courses/archive/fall18/cos324/)\n - Programming generally asks you to build some ML algo from scratch (e.g. MLE regression, neural network)\n - Theoretical problems are a mixed bag: proving/showing/calculating probability/optimization/linear results\n - Median started around 93 and seems to be dropping each assn\n\nPrecepts:\n   - All the preceptors this sem know their shit and how to explain pretty well, Jad and Farhan are probably the best\n   - Covers foundation material (prereqs minus programming)\n   - Like 217 precepts in terms of help with HW, maybe a few notches less since there’s so much foundation required for ML\n\nMidterm:\n   - Tests understanding of theoretical aspects of course\n   - 6 questions, 90 minutes\n   - Given one practice exam, was pretty fair, but hard\n   - Median of weighted grade percents from HW1, HW2, midterm: 78\n\nPiazza:\n   - Not as lit as 217/226/326, response time anywhere from ~1 day to a few hours generally\n\nTLDR: It’s a good course for what it’s meant to do."], ["November 9, 2018 at 8:21 am", "Any advice on how to pick courses when you don’t feel strongly about any of the offerings? I’m a sophomore and have already filled up all of my prerequisites to declare and the two gen ed reqs I have left are not offering something I find interesting.", "Response from Scarlett O’Hara:\n\nwell goodness, someone’s sounding like my mother! lol but I guess thanks for looking out for my well-being.  I’m not a very good sleeper so I had no actual reason to sleep 5 hours other than I just couldn’t fall back to sleep rip (but I’ve got a ton of super short readings, so every time I finish a reading, I’m answering a question… but I’m also near the end of the short readings so I’ll be disappearing again soon lol)"], ["November 9, 2018 at 8:15 am", "How long does it take you guys to answer questions? Sometimes I see you guys answering like ten at a time (some of significant length) and I get worried we’re bothering you /making you waste time", "Response from Scarlett O’Hara:\n\nAsk your friends if any of them want to take a gen ed req with you so at least if you don’t care for the class, you can still look forward to it and do work with your friend. Other than that, if there’s really nothing that interests you, pick the one with the best rating and reviews so at least it’ll be an easy boring class instead of a moderate boring class. You could also decide from the get-go that you’ll be pdfing these gen eds so you can spend as little time as possible on uninteresting material. Hope at least one of these suggestions helps, other than this, there isn’t much else you can do but grit your teeth and push thru"], ["November 9, 2018 at 8:08 am", "constantly defeat myself by wasting time on truly meaningless things that i know i don’t care about (eg facebook, reading random articles on buzzfeed) for amounts of time much longer than normal. how to break out of this cycle? it is really starting to negatively effect me and my schoolwork but i can’t seem to bring myself to care.", "Response from Scarlett O’Hara:\n\nAwww you’re so sweet!! No need to worry about us, we chose and love doing rtp! I definitely use rtp to procrastinate sometimes, but usually I log on as a wholesome break from doing work bc I always feel happier when I’ve helped a few people out.  also for me at least, I’ll leave the tab open and answer a question every few pages or pset questions I’ve completed, so I don’t get burnt out from working. Anyway the time I would’ve been squandering on facebook and buzzfeed now gets put to much better use on rtp, so it’s a win-win for everyone!!! It’s our pleasure to answer your questions!"], ["November 9, 2018 at 7:50 am", "Does anyone else get slightly concerned by the number of people on here at all hours of the day and night?", "Response from Scarlett O’Hara:\n\nLol yup. It always surprises me how many questions build up in the inbox from super late at night / early in the morning. RTP is a 24/7 one-stop shop for everything you need: it’s the advice, relationship drama, and procrastination station "], ["November 9, 2018 at 7:45 am", "What % of people in eco100 get As roughly", "Response from Scarlett O’Hara:\n\n\nroughly 30-35%"], ["November 9, 2018 at 7:39 am", "Sophomore here. Trying to decide if I should knock out one or two distribution requirements next semester. I definitely want to get my STL over with in the spring, but there are three classes in my major I also want to take. That would leave me with three more distribution requirements to complete before graduation. No need to take a five class semester in order to rush to finish the distributions right?", "Response from Scarlett O’Hara:\n\nYou’ll be fine just knocking out one dist next semester. Definitely no need to rush, three distributions left after sophomore year is totally fine; you can just take one dist a semester as a fun/easier break from your major classes. "], ["November 9, 2018 at 7:29 am", "You don't need 217 for COS 426; no one will check. You barely need 226. Most of the coding in the class is pretty straightforward and very fun/rewarding (I hear they are rewriting assignments to be more clear too, which was the one common gripe).", "Response from Scarlett O’Hara:\n\n\nThank you! Just to be sure, can any other readers confirm / give input, just so we make sure we’re giving accurate advice? "], ["November 9, 2018 at 7:18 am", "how does MOL 214, CHM 202, FRE 107 and writing seminar look for freshman spring? premed potential MOL major although seriously considering being premed with a French major", "Response from Scarlett O’Hara: \n\nYup looks very manageable "], ["November 9, 2018 at 1:01 am", "Did anyone with laundry service not get their laundry returned today?", ""], ["November 9, 2018 at 1:01 am", "If wer'e asking OPs for updates, @ OP with crush with history did you ever reach out", "Response from Winnie P:\n\ni love it! everyone please update on your romantic situations!\n"], ["November 9, 2018 at 1:00 am", "I’m in 7 clubs. I want to drop one that I don’t like but I’m in an officer/lower board position. Should I just wait it out until next year?", "Response from Scarlett O’Hara:\n\nI’d say drop it responsibly, so give a notice that you’d like to drop in *reasonable time frame* so that your responsibilities can be passed on to another member or shared by other existing officers. The reasonable time frame really depends on what kind of club this is, what your position is, and what your responsibilities are. That’s a lot of clubs to be involved with so you’ve definitely earned the right to drop a few if you’re not thrilled"], ["November 9, 2018 at 12:55 am", "how does cos226, mat202, writing sem, a language, and an easyish 5th class sound for the spring? tyty", "Response from Scarlett O’Hara:\n\ncos226 with writing sem will be a significant chunk of work but I know a good number of people who had very similar schedules and made it work. Midterms week might hit you harder esp since spring semester only has spring break, so be sure to work responsibly from the start. "], ["November 9, 2018 at 12:39 am", "I struggle with pdfing classes every semester. I always tell myself to pdf if I get under a certain score, but once pdf starts I start telling myself not to pdf... because I don't want the work I've done to go to waste, getting a P still seems pretty stressful (I would put the same effort into it to make sure I get the P), the possibility of raising my gpa if I'm lucky is enticing. But if I don't pdf, I end up getting an OK grade that lowers my gpa anyway. I would appreciate some advice :(", "Response from Scarlett O’Hara:\n\nThis has been in the inbox for a little while, so I guess we’re all a little unsure of what to advise.  \n\nSince you’ve already seen that not pdfing a class after contemplating it only gets you an ok grade that lowers your gpa, I think you’ve proven to yourself to trust in your first pdf-instinct and not second-guess. Since this is a recurring problem for you, you might need to change strategies to avoid this problem in the future: maybe select courses based on whether or not you’ll pdf, instead of debating whether to pdf while you’re taking it, start the course with the mindset of your course of action. That way you’re not starting off dedicating so much time that you feel guilty “letting the work go to waste” but you can still be conscious of your efforts to get a P. You definitely should not put the same amount of effort in to get an A as to get a P; if you really think a class requires equal effort to get an A as to get a C, then you’re pdfing the wrong class lol. You’ve gotta practice some tough love and really be honest with yourself about how well you think you can perform in a class. I would be more upset with myself for lowering my gpa again than for missing out on the possibility of raising my gpa tbh, but maybe that’s just me. "]]